marzzelo/C18/SRC/rx433/p18f8722_defs.h
//;+------------------------------------------------------------------+
//;|       $Workfile:: p18f8722_defs.h            $ $Revision:: 10    $
//;+------------------------------------------------------------------+
//;|         $Author:: valdez                                         $
//;|        $Modtime:: 23/12/13 12:56                                 $
//;|        $Archive:: /@C18/SRC/rx433/p18f8722_defs.h                $
//;+------------------------------------------------------------------+

/*
				http://www.network-science.de/ascii/  font: rounded/small/standard
		 ____  ___  ____    _   ___   _____    ___  _____  ____   ____  
		|  _ \|_ _|/ ___|  / | ( _ ) |  ___|  ( _ )|___  ||___ \ |___ \ 
		| |_) || || |      | | / _ \ | |_     / _ \   / /   __) |  __) |
		|  __/ | || |___   | || (_) ||  _|   | (_) | / /   / __/  / __/ 
		|_|   |___|\____|  |_| \___/ |_|      \___/ /_/   |_____||_____|
           PIC 18F8722 - Definiciones para carga directa de registros 		  


						  ___  ___  ___ ___ ___  _ __  
						 / _ \/ __|/ __/ __/ _ \| '_ \ 
						| (_) \__ \ (_| (_| (_) | | | |
						 \___/|___/\___\___\___/|_| |_|	                               
					   OSCCON OSCILLATOR CONTROL REGISTER				 		  */
				                                                                                              
// para OSCCON

// A. Comportamiento frente a SLEEP
#define IDLE_ON_SLEEP 		0b11111111      // Device enters Idle mode on SLEEP instruction
#define SLEEP_ON_SLEEP 		0b01111111		// Device enters Sleep mode on SLEEP instruction

// B. Clock source Select
#define CLK_INT				0b11111111		// Internal oscillator (Ver opciones C)
#define CLK_TMR1			0b11111101		// Timer1 oscillator (SECONDARY SOURCE)
#define CLK_OSC				0b11111100		// Primary oscillator (PRIMARY SOURCE)

// C. Prescaler (válido solamente para modo CLK_INT)
#define INTOSC_8			0b11111111		// 8 MHz (INTOSC drives clock directly)
#define INTOSC_4			0b11101111		// 4 MHz
#define INTOSC_2			0b11011111		// 2 MHz
#define INTOSC_1	 		0b11001111		// 1 MHz
#define INTOSC_500			0b10111111		// 500 kHz
#define INTOSC_250			0b10101111		// 250 kHz
#define INTOSC_125			0b10011111		// 125 kHz
#define INTOSC_31			0b10001111		// 31 kHz (from either INTOSC/256 or INTRC directly)
											// Source selected by the INTSRC bit (OSCTUNE<7>), see text.
/*
					 _    _                           ___  
					| |_ (_) _ __ ___    ___  _ __   / _ \ 
					| __|| || '_ ` _ \  / _ \| '__| | | | |
					| |_ | || | | | | ||  __/| |    | |_| |
					 \__||_||_| |_| |_| \___||_|     \___/ 					  
					 														  */
// Para T0CON, elegir uno de cada categoría:

// A. ON/OFF 
#define T0_ON				0xFF			// Enables Timer0
#define T0_OFF				0b01111111		// Stops Timer0

// B. 8 / 16 BITS
#define T0_8BIT				0xFF			// Timer0 is configured as an 8-bit timer/counter
#define T0_16BIT			0b10111111		// Timer0 is configured as a 16-bit timer/counter

// C. Clock Source Selection
#define T0_CS_EXT			0xFF			// Transition on T0CKI pin
#define T0_CS_INT			0b11011111		// Internal instruction cycle clock (CLKO)

// D. Edge Selection
#define T0_SE_DOWN			0xFF			// Increment on high-to-low transition on T0CKI pin
#define T0_SE_UP			0b11101111		// Increment on low-to-high transition on T0CKI pin

// E. Prescaler Value
#define T0_PS_1				0xFF			// TImer0 prescaler is NOT assigned. Timer0 clock input bypasses prescaler.
#define T0_PS_2				0b11110000		// 1:2 Prescale value
#define T0_PS_4				0b11110001		// 1:4 Prescale value
#define T0_PS_8				0b11110010		// 1:8 Prescale value
#define T0_PS_16			0b11110011		// 1:16 Prescale value
#define T0_PS_32			0b11110100		// 1:32 Prescale value
#define T0_PS_64			0b11110101		// 1:64 Prescale value
#define T0_PS_128			0b11110110		// 1:128 Prescale value
#define T0_PS_256			0b11110111		// 1:256 Prescale value

/*
					 _    _                          _ 
					| |_ (_) _ __ ___    ___  _ __  / |
					| __|| || '_ ` _ \  / _ \| '__| | |
					| |_ | || | | | | ||  __/| |    | |
					 \__||_||_| |_| |_| \___||_|    |_|
                     	 TIMER1 CONTROL REGISTER 						 	  */
// Para T1CON, elegir uno de cada categoría:

// A. 	bit 7 		RD16: 16-Bit Read/Write Mode Enable bit 
#define RD16_ON				0xFF			// 1 = Enables register read/write of TImer1 in one 16-bit operation
#define RD16_OFF			0b01111111		// 0 = Enables register read/write of Timer1 in two 8-bit operations

// B. 	bit 6 		READ/ONLY

// C. 	bit 5-4 	T1CKPS1:T1CKPS0: Timer1 Input Clock Prescale Select bits
#define T1_PS_8  			0xFF			// 11 = 1:8 Prescale value
#define T1_PS_4  			0b11101111		// 10 = 1:4 Prescale value
#define T1_PS_2  			0b11011111		// 01 = 1:2 Prescale value
#define T1_PS_1  			0b11001111		// 00 = 1:1 Prescale value

// D. 	bit 3 		T1OSCEN: Timer1 Oscillator Enable bit
#define T1_ENABLED			0xFF			// 1 = Timer1 oscillator is enabled
#define T1_DISABLED			0b11110111		// 0 = Timer1 oscillator is shut off

// E. 	bit 2 		T1SYNC: Timer1 External Clock Input Synchronization Select bit
#define T1_SYNC_OFF			0xFF			// 1 = Do not synchronize external clock input
#define T1_SYNC_ON			0b11110000		// 0 = Synchronize external clock input

// F. 	bit 1 		TMR1CS: Timer1 Clock Source Select bit
#define T1_CS_EXT			0xFF      		// 1 = External clock from pin RC0/T1OSO/T13CKI (on the rising edge)
#define T1_CS_INT			0b11111101		// 0 = Internal clock (FOSC/4)

// G.	bit 0 		TMR1ON: Timer1 On bit
#define T1_ON				0xFF			// 1 = Enables Timer1
#define T1_OFF				0b11111110		// 0 = Stops Timer1

/*
					       _                      ______  
					   _  (_)                    (_____ \ 
					 _| |_ _ ____  _____  ____     ____) )
					(_   _) |    \| ___ |/ ___)   / ____/ 
					  | |_| | | | | ____| |      | (_____ 
					   \__)_|_|_|_|_____)_|      |_______)
                     	 	TIMER2 CONTROL REGISTER 					 	  */	
               	 	
//bit 7 Unimplemented: Read as ‘0’

//bit 6-3 T2OUTPS3:T2OUTPS0: Timer2 Output Postscale Select bits
//0000 = 1:1 Postscale
//0001 = 1:2 Postscale
//...
//1111 = 1:16 Postscale
#define T2OUTPS_1			0b00000000
#define T2OUTPS_2			0b00001000
#define T2OUTPS_3			0b00010000
#define T2OUTPS_4			0b00011000
#define T2OUTPS_5			0b00100000
#define T2OUTPS_6			0b00101000
#define T2OUTPS_7			0b00110000
#define T2OUTPS_8			0b00111000
#define T2OUTPS_9			0b01000000
#define T2OUTPS_10			0b01001000
#define T2OUTPS_11			0b01010000
#define T2OUTPS_12			0b01011000
#define T2OUTPS_13			0b01100000
#define T2OUTPS_14			0b01101000
#define T2OUTPS_15			0b01110000
#define T2OUTPS_16			0b01111000

//bit 2 TMR2ON: Timer2 On bit
//1 = Timer2 is on
//0 = Timer2 is off
#define TMR2_ON				0b00000100
#define TMR2_OFF			0x00


//bit 1-0 T2CKPS1:T2CKPS0: Timer2 Clock Prescale Select bits
//00 = Prescaler is 1
//01 = Prescaler is 4
//1x = Prescaler is 16          
#define T2CKPS_1           	0b00000000
#define T2CKPS_4           	0b00000001
#define T2CKPS_16          	0b00000010
                     	 						                                      
