marzzelo/C18/SRC/rx433/p18f8722_defs.h
/*
						 _         _                     
						(_) _ __  | |_  ___  ___   _ __  
						| || '_ \ | __|/ __|/ _ \ | '_ \ 
						| || | | || |_| (__| (_) || | | |
						|_||_| |_| \__|\___|\___/ |_| |_|                                 
					    INTCON: INTERRUPT CONTROL REGISTER					  */	

// IMPORTANTE:  USAR EL OPERADOR "OR" PARA SELECCIONAR ESTOS BITS!!

//bit 7 GIE/GIEH: Global Interrupt Enable bit
//When IPEN = 0:
//1 = Enables all unmasked interrupts
//0 = Disables all interrupts
//When IPEN = 1:
//1 = Enables all high-priority interrupts
//0 = Disables all interrupts
#define IPEN_ON			0b10000000
#define IPEN_OFF		0x00
#define GIE_ON			0b10000000
#define GIE_OFF			0x00

//bit 6 PEIE/GIEL: Peripheral Interrupt Enable bit
//When IPEN = 0:
//1 = Enables all unmasked peripheral interrupts
//0 = Disables all peripheral interrupts
//When IPEN = 1:
//1 = Enables all low-priority peripheral interrupts
//0 = Disables all low-priority peripheral interrupts
#define PEIE_ON			0b01000000
#define PEIE_OFF		0x00
#define GIEL_ON			0b01000000
#define GIEL_OFF		0x00

//bit 5 TMR0IE: TMR0 Overflow Interrupt Enable bit
//1 = Enables the TMR0 overflow interrupt
//0 = Disables the TMR0 overflow interrupt
#define TMR0IE_ON		0b00100000
#define TMR0IE_OFF		0x00

//bit 4 INT0IE: INT0 External Interrupt Enable bit
//1 = Enables the INT0 external interrupt
//0 = Disables the INT0 external interrupt
#define INT0IE_ON		0b00010000
#define INT0IE_OFF		0x00

//bit 3 RBIE: RB Port Change Interrupt Enable bit
//1 = Enables the RB port change interrupt
//0 = Disables the RB port change interrupt
#define RBIE_ON			0b00001000
#define RBIE_OFF		0x00

	/*				 _                               ______  
					(_)       _                     (_____ \ 
					 _ ____ _| |_ ____ ___  ____      ____) )
					| |  _ (_   _) ___) _ \|  _ \    / ____/ 
					| | | | || |( (__| |_| | | | |  | (_____ 
					|_|_| |_| \__)____)___/|_| |_|  |_______)
						 INTERRUPT CONTROL REGISTER 2				              */

//	bit 7 RBPU: PORTB Pull-up Enable bit
//	1 = All PORTB pull-ups are disabled
//	0 = PORTB pull-ups are enabled by individual port latch values
#define RBPU_ON			0b10000000
#define RBPU_OFF		0x00

//	bit 6 INTEDG0: External Interrupt 0 Edge Select bit
//	1 = Interrupt on rising edge
//	0 = Interrupt on falling edge
#define INTEDG0_UP		0b01000000
#define INTEDG0_DOWN	0x00

//	bit 5 INTEDG1: External Interrupt 1 Edge Select bit
//	1 = Interrupt on rising edge
//	0 = Interrupt on falling edge
#define INTEDG1_UP		0b00100000
#define INTEDG1_DOWN	0x00

//	bit 4 INTEDG2: External Interrupt 2 Edge Select bit
//	1 = Interrupt on rising edge
//	0 = Interrupt on falling edge
#define INTEDG2_UP		0b00010000
#define INTEDG2_DOWN	0x00

//	bit 3 INTEDG3: External Interrupt 3 Edge Select bit
//	1 = Interrupt on rising edge
//	0 = Interrupt on falling edge
#define INTEDG3_UP		0b00001000
#define INTEDG3_DOWN	0x00

//	bit 2 TMR0IP: TMR0 Overflow Interrupt Priority bit
//	1 = High priority
//	0 = Low priority
#define TMR0IP_HI 		0b00000100
#define TMR0IP_LO		0x00

//	bit 1 INT3IP: INT3 External Interrupt Priority bit
//	1 = High priority
//	0 = Low priority
#define INT3IP_HI 		0b00000010
#define INT3IP_LO		0x00

//	bit 0 RBIP: RB Port Change Interrupt Priority bit
//	1 = High priority
//	0 = Low priority
#define RBIP_HI			0b00000001
#define RBIP_LO			0x00

/*
					 _                               ______  
					(_)       _                     (_____ \ 
					 _ ____ _| |_ ____ ___  ____     _____) )
					| |  _ (_   _) ___) _ \|  _ \   (_____ ( 
					| | | | || |( (__| |_| | | | |   _____) )
					|_|_| |_| \__)____)___/|_| |_|  (______/ 
						 INTERRUPT CONTROL REGISTER 3				              */

//	bit 7 INT2IP: INT2 External Interrupt Priority bit
//	1 = High priority
//	0 = Low priority
#define INT2IP_HI		0b10000000
#define INT2IP_LO		0x00

//	bit 6 INT1IP: INT1 External Interrupt Priority bit
//	1 = High priority
//	0 = Low priority
#define INT1IP_HI		0b01000000
#define INT1IP_LO		0x00

//	bit 5 INT3IE: INT3 External Interrupt Enable bit
//	1 = Enables the INT3 external interrupt
//	0 = Disables the INT3 external interrupt
#define INT3IE_ON		0b00100000
#define INT3IE_OFF		0x00

//	bit 4 INT2IE: INT2 External Interrupt Enable bit
//	1 = Enables the INT2 external interrupt
//	0 = Disables the INT2 external interrupt
#define INT2IE_ON		0b00010000
#define INT2IE_OFF		0x00

//	bit 3 INT1IE: INT1 External Interrupt Enable bit
//	1 = Enables the INT1 external interrupt
//	0 = Disables the INT1 external interrupt
#define INT1IE_ON		0b00001000
#define INT1IE_OFF		0x00

/*
								 _            _ 
								(_)_ __  _ __/ |
								| | '_ \| '__| |
								| | |_) | |  | |
								|_| .__/|_|  |_|
								  |_|           
					IPR1: PERIPHERAL INTERRUPT PRIORITY REGISTER 1				*/
					
//bit 7 PSPIP: Parallel Slave Port Read/Write Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define PSPIP_HI	0b10000000
#define PSPIP_LO	0x00

//bit 6 ADIP: A/D Converter Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define ADIP_HI	0b01000000
#define ADIP_LO	0x00

//bit 5 RC1IP: EUSART1 Receive Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define RC1IP_HI	0b00100000
#define RC1IP_LO	0x00

//bit 4 TX1IP: EUSART1 Transmit Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define TX1IP_HI	0b00010000
#define TX1IP_LO	0x00

//bit 3 SSP1IP: MSSP1 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define SSP1IP_HI	0b00001000
#define SSP1IP_LO	0x00

//bit 2 CCP1IP: ECCP1 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define CCP1IP_HI	0b00000100
#define CCP1IP_LO	0x00

//bit 1 TMR2IP: TMR2 to PR2 Match Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define TMR2IP_HI	0b00000010
#define TMR2IP_LO	0x00

//bit 0 TMR1IP: TMR1 Overflow Interrupt Priority bit
//1 = High priority
//0 = Low priority			
#define TMR1IP_HI	0b00000001
#define TMR1IP_LO	0x00
		
/* 
								 _          ___  
								(_)        |__ \ 
								 _ _ __  _ __ ) |
								| | '_ \| '__/ / 
								| | |_) | | / /_ 
								|_| .__/|_||____|
								  | |            
								  |_|            
					IPR2: PERIPHERAL INTERRUPT PRIORITY REGISTER 2				*/

