marzzelo/C18/SRC/rx433/p18f8722_defs.h
//bit 7 OSCFIP: Oscillator Fail Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define OSCFIP_HI	0b10000000
#define OSCFIP_LO	0x00

//bit 6 CMIP: Comparator Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define CMIP_HI		0b01000000
#define CMIP_LO		0x00

//bit 5 Unimplemented: Read as '0'

//bit 4 EEIP: Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define EEIP_HI		0b00010000
#define EEIP_LO		0x00

//bit 3 BCL1IP: MSSP1 Bus Collision Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define BCL1IP_HI	0b00001000
#define BCL1IP_LO	0x00

//bit 2 HLVDIP: High/Low-Voltage Detect Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define HLVDIP_HI	0b00000100
#define HLVDIP_LO	0x00

//bit 1 TMR3IP: TMR3 Overflow Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define TMR3IP_HI	0b00000010
#define TMR3IP_LO	0x00

//bit 0 CCP2IP: ECCP2 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define CCP2IP_HI	0b00000001
#define CCP2IP_LO	0x00

/* 
								
								 _           ____  
								(_)         |___ \ 
								 _ _ __  _ __ __) |
								| | '_ \| '__|__ < 
								| | |_) | |  ___) |
								|_| .__/|_| |____/ 
								  | |              
								  |_|              
					IPR3: PERIPHERAL INTERRUPT PRIORITY REGISTER 3
*/

//bit 7 SSP2IP: MSSP2 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define SSP2IP_HI	0b10000000
#define SSP2IP_LO	0x00

//bit 6 BCL2IP: MSSP2 Bus Collision Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define BCL2IP_HI	0b01000000
#define BCL2IP_LO	0x00

//bit 5 RC2IP: EUSART2 Receive Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define RC2IP_HI	0b00100000
#define RC2IP_LO	0x00

//bit 4 TX2IP: EUSART2 Transmit Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define TX2IP_HI	0b00010000
#define XT2IP_LO	0x00

//bit 3 TMR4IP: TMR4 to PR4 Match Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define TMR4IP_HI	0b00001000
#define TMR4IP_LO	0x00

//bit 2 CCP5IP: CCP5 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define CCP5IP_HI	0b00000100
#define CCP5IP_LO	0x00

//bit 1 CCP4IP: CCP4 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define CCP4IP_HI	0b00000010
#define CCP4IP_LO	0x00

//bit 0 CCP3IP: ECCP3 Interrupt Priority bit
//1 = High priority
//0 = Low priority
#define CCP3IP_HI	0b00000001
#define CCP3IP_LO	0x00



/*						
						 ____  _____ ____   ____ ___  ____  
						|    \| ___ |    \ / ___) _ \|  _ \ 
						| | | | ____| | | ( (__| |_| | | | |
						|_|_|_|_____)_|_|_|\____)___/|_| |_|
						EXTERNAL MEMORY BUS CONTROL REGISTER				  */
							
//	bit 7 EBDIS: External Bus Disable bit
//	1 = External bus enabled when microcontroller accesses external memory;
//	otherwise, all external bus drivers are mapped as I/O ports
//	0 = External bus always enabled, I/O ports are disabled
#define EBDISABLE		0b10000000
#define EBENABLE		0x00

//	bit 6 Unimplemented: Read as ‘0’

//	bit 5-4 WAIT1:WAIT0: Table Reads and Writes Bus Cycle Wait Count bits
//	11 = Table reads and writes will wait 0 TCY
//	10 = Table reads and writes will wait 1 TCY
//	01 = Table reads and writes will wait 2 TCY
//	00 = Table reads and writes will wait 3 TCY
#define WAIT_0TCY		0b00110000
#define WAIT_1TCY		0b00100000
#define WAIT_2TCY		0b00010000
#define WAIT_3TCY		0x00

//	bit 3-2 Unimplemented: Read as ‘0’

//	bit 1-0 WM1:WM0: TBLWT Operation with 16-bit Data Bus Width Select bits
//	1x = Word Write mode: TABLAT0 and TABLAT1 word output, WRH active when
//	TABLAT1 written
//	01 = Byte Select mode: TABLAT data copied on both MSB and LSB, WRH and (UB or LB)
//	will activate
//	00 = Byte Write mode: TABLAT data copied on both MSB and LSB, WRH or WRL will activate						

/*
                                         _         
						 _ __  ___  ___ | |_  __ _ 
						| '__|/ __|/ __|| __|/ _` |
						| |  | (__ \__ \| |_| (_| |
						|_|   \___||___/ \__|\__,_|
				 RCSTA: RECEIVE STATUS AND CONTROL REGISTER         		  */

// IMPORTANTE:  USAR EL OPERADOR "OR" PARA SELECCIONAR ESTOS BITS!!

//bit 7 SPEN: Serial Port Enable bit
//1 = Serial port enabled (configures RX/DT and TX/CK pins as serial port pins)
//0 = Serial port disabled (held in Reset)
#define SPEN_ON			0b10000000
#define SPEN_OFF		0x00

//bit 6 RX9: 9-Bit Receive Enable bit
//1 = Selects 9-bit reception
//0 = Selects 8-bit reception
#define RX9_ON			0b01000000
#define RX9_OFF			0x00

//bit 5 SREN: Single Receive Enable bit
//Asynchronous mode: Don?t care.
//Synchronous mode ? Master:
//1 = Enables single receive
//0 = Disables single receive
//This bit is cleared after reception is complete.
//Synchronous mode ? Slave: Don?t care.
#define SREN_ON			0b00100000
#define SREN_OFF		0x00

//bit 4 CREN: Continuous Receive Enable bit
//Asynchronous mode:
//1 = Enables receiver
//0 = Disables receiver
//Synchronous mode:
//1 = Enables continuous receive until enable bit, CREN, is cleared (CREN overrides SREN)
//0 = Disables continuous receive
#define CREN_ON			0b00010000
#define CREN_OFF		0x00

//bit 3 ADDEN: Address Detect Enable bit
//Asynchronous mode 9-Bit (RX9 = 1):
//1 = Enables address detection, enables interrupt and loads the receive buffer when RSR<8> is set
//0 = Disables address detection, all bytes are received and ninth bit can be used as parity bit
//Asynchronous mode 9-Bit (RX9 = 0): don?t care.
#define ADDEN_ON		0b00001000
#define ADDEN_OFF		0x00

//bit 2 FERR: Framing Error bit
//1 = Framing error (can be cleared by reading RCREG register and receiving next valid byte)
//0 = No framing error

/*(READ ONLY)*/

//bit 1 OERR: Overrun Error bit
//1 = Overrun error (can be cleared by clearing bit, CREN)
//0 = No overrun error

/*(READ ONLY)*/

//bit 0 RX9D: 9th Bit of Received Data
//This can be address/data bit or a parity bit and must be calculated by user firmware.

/*(READ ONLY)*/

/*
						 _               _         
						| |_ __  __ ___ | |_  __ _ 
						| __|\ \/ // __|| __|/ _` |
						| |_  >  < \__ \| |_| (_| |
						 \__|/_/\_\|___/ \__|\__,_|
			TXSTA1/TXSTA2: TRANSMIT STATUS AND CONTROL REGISTER        		  */

// IMPORTANTE:  USAR EL OPERADOR "OR" PARA SELECCIONAR ESTOS BITS!!

//bit 7 CSRC: Clock Source Select bit
//Asynchronous mode: Don?t care.
//Synchronous mode:
//1 = Master mode (clock generated internally from BRG)
//0 = Slave mode (clock from external source)
#define CSRC_INT		0b10000000
#define CSRC_EXT		0x00

//bit 6 TX9: 9-Bit Transmit Enable bit
//1 = Selects 9-bit transmission
//0 = Selects 8-bit transmission
#define TX9_ON			0b01000000
#define TX9_OFF			0x00

