marzzelo/C18/SRC/rx433/p18f8722_defs.h
//bit 5 TXEN: Transmit Enable bit(1)
//1 = Transmit enabled
//0 = Transmit disabled
#define TXEN_ON			0b00100000
#define TXEN_OFF		0x00

//bit 4 SYNC: EUSART Mode Select bit
//1 = Synchronous mode
//0 = Asynchronous mode
#define SYNC_ON			0b00010000
#define SYNC_OFF		0x00

//bit 3 SENDB: Send Break Character bit
//Asynchronous mode:
//1 = Send Sync Break on next transmission (cleared by hardware upon completion)
//0 = Sync Break transmission completed
//Synchronous mode: Don?t care.
#define SENDB_ON		0b00001000
#define SEMDB_OFF		0x00

//bit 2 BRGH: High Baud Rate Select bit
//Asynchronous mode:
//1 = High speed
//0 = Low speed
//Synchronous mode: Unused in this mode.
#define BRGH_HI			0b00000100
#define BRGH_LO 		0x00

//bit 1 TRMT: Transmit Shift Register Status bit
//1 = TSR empty
//0 = TSR full

/*(READ ONLY)*/

//bit 0 TX9D: 9th Bit of Transmit Data
//Can be address/data bit or a parity bit.
//Note 1: SREN/CREN overrides TXEN in Sync mode.

/*(READ ONLY / DATA)*/

/*
						 ____  ___  _____   _ 
						|  _ \|_ _|| ____| / |
						| |_) || | |  _|   | |
						|  __/ | | | |___  | |
						|_|   |___||_____| |_|
				   P  I  E  1  -  INTERRUPT ENABLE   					      */

// IMPORTANTE:  USAR EL OPERADOR "OR" PARA SELECCIONAR ESTOS BITS!!

//	bit 7 SPPIE: Streaming Parallel Port Read/Write Interrupt Enable bit(1)
//	1 = Enables the SPP read/write interrupt
//	0 = Disables the SPP read/write interrupt
#define SPPIE_ON			0b10000000
#define SPPIE_OFF			0x00

//	bit 6 ADIE: A/D Converter Interrupt Enable bit
//	1 = Enables the A/D interrupt
//	0 = Disables the A/D interrupt
#define ADIE_ON				0b01000000
#define ADIE_OFF			0x00

//	bit 5 RCIE: EUSART Receive Interrupt Enable bit
//	1 = Enables the EUSART receive interrupt
//	0 = Disables the EUSART receive interrupt
#define EUSART_RX_ON		0b00100000
#define EUSART_RX_OFF		0x00

//	bit 4 TXIE: EUSART Transmit Interrupt Enable bit
//	1 = Enables the EUSART transmit interrupt
//	0 = Disables the EUSART transmit interrupt
#define EUSART_TX_ON		0b00010000
#define EUSART_TX_OFF		0x00

//	bit 3 SSPIE: Master Synchronous Serial Port Interrupt Enable bit
//	1 = Enables the MSSP interrupt
//	0 = Disables the MSSP interrupt
#define SSPIE_ON			0b00001000
#define SSPIE_OFF			0x00

//	bit 2 CCP1IE: CCP1 Interrupt Enable bit
//	1 = Enables the CCP1 interrupt
//	0 = Disables the CCP1 interrupt
#define CCP1IE_ON			0b00000100
#define CCP1IE_OFF			0x00

//	bit 1 TMR2IE: TMR2 to PR2 Match Interrupt Enable bit
//	1 = Enables the TMR2 to PR2 match interrupt
//	0 = Disables the TMR2 to PR2 match interrupt
#define TMR2IE_ON			0b00000010
#define TMR2IE_OFF			0x00

//bit 0 TMR1IE: TMR1 Overflow Interrupt Enable bit
//	1 = Enables the TMR1 overflow interrupt
//	0 = Disables the TMR1 overflow interrupt
#define TMR1IE_ON			0b00000001
#define TMR1IE_OFF			0x00

/*
					 ______  _ _______    ______  
					(_____ \| (_______)  (_____ \ 
					 _____) ) |_____       ____) )
					|  ____/| |  ___)     / ____/ 
					| |     | | |_____   | (_____ 
					|_|     |_|_______)  |_______)	
				PERIPHERAL INTERRUPT ENABLE REGISTER 2						  */
				
//	bit 7 OSCFIE: Oscillator Fail Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define OSCFIE_ON			0b10000000
#define OSCFIE_OFF			0x00

//	bit 6 CMIE: Comparator Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define CMIE_ON				0b01000000
#define CMIE_OFF			0x00

//	bit 5 Unimplemented: Read as ‘0’

//	bit 4 EEIE: Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define EEIE_ON				0b00010000
#define EEIE_OFF			0x00

//	bit 3 BCL1IE: MSSP1 Bus Collision Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define BCL1IE_ON			0b00001000
#define BCL1IE_OFF			0x00

//	bit 2 HLVDIE: High/Low-Voltage Detect Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define HLVDIE_ON			0b00000100
#define HLVDIE_OFF			0x00

//	bit 1 TMR3IE: TMR3 Overflow Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define TMR3IE_ON			0b00000010
#define TMR3IE_OFF			0x00


//	bit 0 CCP2IE: ECCP2 Interrupt Enable bit
//	1 = Enabled
//	0 = Disabled
#define CCP2IE_ON			0b00000001
#define CCP2IE_OFF			0x00



/*
				            _                       ___  
				  __ _   __| |  ___  ___   _ __    / _ \ 
				 / _` | / _` | / __|/ _ \ | '_ \  | | | |
				| (_| || (_| || (__| (_) || | | | | |_| |
				 \__,_| \__,_| \___|\___/ |_| |_|  \___/ 
						  A/D CONTROL REGISTER					  			  */
						  
//  +--------+--------+--------+--------+--------+--------+--------+--------+
//  |                                 ADCON0                                |
//  +--------+--------+--------+--------+--------+--------+--------+--------+
//  |U       |U       |R/W     |R/W     |R/W     |R/W     |R/W     |R/W     |
//	|0       |0       |0       |0       |0       |0       |0       |0       |
//  +--------+--------+--------+--------+--------+--------+--------+--------+
//	|   --   |   --   |CHS3    |CHS2    |CHS1    |CHS0    |GO/DONE |ADON    |
//  |7       |6       |5       |4       |3       |2       |1       |0       |
//  +--------+--------+--------+--------+--------+--------+--------+--------+

// CHS2:CHS0: Analog Channel Select bits (Forces ADON = 1)

// Nota: ver macro OpenADC(canal), reemplaza a estas definiciones
#define AD_ON_CH0				0b00000001		// Channel 0 (AN0) & ADON
#define AD_ON_CH1				0b00000101		// Channel 1 (AN1) & ADON
#define AD_ON_CH2				0b00001001		// Channel 2 (AN2) & ADON
#define AD_ON_CH3				0b00001101		// Channel 3 (AN3) & ADON
#define AD_ON_CH4				0b00010001		// Channel 4 (AN4) & ADON
#define AD_ON_CH5				0b00010101		// Channel 5 (AN5) & ADON
#define AD_ON_CH6				0b00011001		// Channel 6 (AN6) & ADON
#define AD_ON_CH7				0b00011101		// Channel 7 (AN7) & ADON
#define AD_ON_CH8				0b00100001		// Channel 8 (AN7) & ADON
#define AD_ON_CH9				0b00100101		// Channel 9 (AN7) & ADON
#define AD_ON_CH10				0b00101001		// Channel 10(AN7) & ADON
#define AD_ON_CH11				0b00101101		// Channel 11(AN7) & ADON
#define AD_ON_CH12				0b00110001		// Channel 12(AN7) & ADON
#define AD_ON_CH13				0b00110101		// Channel 13(AN7) & ADON
#define AD_ON_CH14				0b00111001		// Channel 14(AN7) & ADON
#define AD_ON_CH15				0b00111101		// Channel 15(AN7) & ADON

// Para setear ADON en tiempo posterior:
#define AD_CH0					0b00000000		// Channel 0 (AN0 = RA0) 
#define AD_CH1					0b00000100		// Channel 1 (AN1 = RA1) 
#define AD_CH2					0b00001000		// Channel 2 (AN2 = RA2) 
#define AD_CH3					0b00001100		// Channel 3 (AN3 = RA3) 
#define AD_CH4					0b00010000		// Channel 4 (AN4 = *RA5) <--
#define AD_CH5					0b00010100		// Channel 5 (AN5 = RF0) <--
#define AD_CH6					0b00011000		// Channel 6 (AN6 = RF1) 
#define AD_CH7					0b00011100		// Channel 7 (AN7 = RF2) 
#define AD_CH8					0b00100000		// Channel 8 (AN8 = RF3) 
#define AD_CH9					0b00100100		// Channel 9 (AN9 = RF4) 
#define AD_CH10					0b00101000		// Channel 10(AN10 = RF5) 
#define AD_CH11					0b00101100		// Channel 11(AN11 = RF6)
#define AD_CH12					0b00110000		// Channel 12(AN12 = *RH4) <--
#define AD_CH13					0b00110100		// Channel 13(AN13 = RH5) 
#define AD_CH14					0b00111000		// Channel 14(AN14 = RH6) 
#define AD_CH15					0b00111100		// Channel 15(AN15 = RH7) 

#define AD_OFF					0x00
#define AD_ON					0b00000001		// usar con bitOR

