marzzelo/C18/SRC/rx433/p18f8722_defs.h
/*				
				            _                      _ 
				  __ _   __| |  ___  ___   _ __   / |
				 / _` | / _` | / __|/ _ \ | '_ \  | |
				| (_| || (_| || (__| (_) || | | | | |
				 \__,_| \__,_| \___|\___/ |_| |_| |_|

//  +--------+--------+--------+--------+--------+--------+--------+--------+
//  |                                 ADCON1                                |
//  +--------+--------+--------+--------+--------+--------+--------+--------+
//  |U       |U       |R/W     |R/W     |R/W     |R/W     |R/W     |R/W     |
//	|0       |0       |0       |0       |0       |*       |*       |*       |
//  +--------+--------+--------+--------+--------+--------+--------+--------+
//	|   --   |   --   |VCFG1   |VCFG0   |PCFG3   |PCFG2   |PCFG1   |PCFG0   |
//  |7       |6       |5       |4       |3       |2       |1       |0       |
//  +--------+--------+--------+--------+--------+--------+--------+--------+
/* (*)The value of the PCFG bits depends on the value of the PBADEN configuration
      bit. When PBADEN = 1, PCFG<3:0> = 0000; when PBADEN = 0, PCFG<3:0> = 0111 */

//	bit 7-6 Unimplemented: Read as '0'

//	bit 5 	VCFG1: 			Voltage Reference Configuration bit (VREF- source)
//	1 = VREF- (AN2)
//	0 = VSS
#define VCFG1_AN2			0x3F
#define VCFG1_VSS			0b00011111

//	bit 4 	VCFG0: 			Voltage Reference Configuration bit (VREF+ source)
//	1 = VREF+ (AN3)
//	0 = VDD
#define VCFG0_AN3			0x3F
#define VCFG0_VDD			0b00101111

//	bit 3-0 	PCFG3:PCFG0: 	A/D Port Configuration Control bits:	
#define A16_D0				0b00110000		// ANALOG:16, DIGITAL:0	
#define A14_D2				0b00110001		// No existe A15_D1 !!!
#define A13_D3				0b00110010						
#define A12_D4				0b00110011			
#define A11_D5				0b00110100			
#define A10_D6				0b00110101			
#define A9_D7				0b00110110			
#define A8_D8				0b00110111			
#define A7_D9				0b00111000			
#define A6_D10				0b00111001			
#define A5_D11				0b00111010			
#define A4_D12				0b00111011			
#define A3_D13				0b00111100			
#define A2_D14				0b00111101			
#define A1_D15				0b00111110			
#define A0_D16				0x3F			// ANALOG:0, DIGITAL:16

/*
					            _                      ____  
					  __ _   __| |  ___  ___   _ __   |___ \ 
					 / _` | / _` | / __|/ _ \ | '_ \    __) |
					| (_| || (_| || (__| (_) || | | |  / __/ 
					 \__,_| \__,_| \___|\___/ |_| |_| |_____|		
					                                         				  */
//	bit 7 ADFM: A/D Result Format Select bit
//	1 = Right justified
//	0 = Left justified
#define AD_RIGHT			0xFF				// Right justified
#define AD_LEFT				0b01111111			// Left justified

//	bit 6 Unimplemented: Read as '0'
//	
//	bit 5-3 ACQT2:ACQT0: A/D Acquisition Time Select bits
//	111 = 20 TAD
//	110 = 16 TAD
//	101 = 12 TAD
//	100 = 8 TAD
//	011 = 6 TAD
//	010 = 4 TAD
//	001 = 2 TAD
//	000 = 0 TAD(1)
#define ACQT_20					0xFF			
#define ACQT_16					0b11110111		
#define ACQT_12					0b11101111		
#define ACQT_8 					0b11100111		
#define ACQT_6 					0b11011111		
#define ACQT_4 					0b11010111		
#define ACQT_2 					0b11001111		
#define ACQT_0 					0b11000111		


//	bit 2-0 ADCS2:ADCS0: A/D Conversion Clock Select bits
//	111 = FRC (clock derived from A/D RC oscillator)(1)
//	110 = FOSC/64
//	101 = FOSC/16
//	100 = FOSC/4
//	011 = FRC (clock derived from A/D RC oscillator)(1) (repetido, no se define)
//	010 = FOSC/32
//	001 = FOSC/8
//	000 = FOSC/2
#define ADCS_FRC				0xFF			// FRC (clock derived from A/D RC oscillator)
#define ADCS_64					0b11111110		// Conv Clock =  2·TOSC
#define ADCS_16					0b11111101		// Conv Clock =  4·TOSC
#define ADCS_4					0b11111100		// Conv Clock =  8·TOSC
#define ADCS_32					0b11111010		// Conv Clock =  8·TOSC
#define ADCS_8 					0b11111001		// Conv Clock = 32·TOSC
#define ADCS_2 					0b11111000		// Conv Clock = 64·TOSC


/*
					 _      _            _                    
					| |__  | |__   __ __| |  ___  ___   _ __  
					| '_ \ | |\ \ / // _` | / __|/ _ \ | '_ \ 
					| | | || | \ V /| (_| || (__| (_) || | | |
					|_| |_||_|  \_/  \__,_| \___|\___/ |_| |_|
				 HLVDCON: HIGH/LOW-VOLTAGE DETECT CONTROL REGISTER			  

	R/W-0 		U-0 R-0 	R/W-0 	R/W-0 		R/W-1 		R/W-0 		R/W-1
	VDIRMAG 	— 	IRVST 	HLVDEN 	HLVDL3(1) 	HLVDL2(1) 	HLVDL1(1) 	HLVDL0(1)
	bit 7 																   bit 0
	
//	bit 7 VDIRMAG: Voltage Direction Magnitude Select bit
//	1 = Event occurs when voltage equals or exceeds trip point (HLVDL3:HLDVL0)
//	0 = Event occurs when voltage equals or falls below trip point (HLVDL3:HLVDL0) */
#define HLVDUP				0b10000000
#define HLVDDOWN			0x00

//	bit 6 Unimplemented: Read as ‘0’

//	bit 5 IRVST: Internal Reference Voltage Stable Flag bit
//	1 = Indicates that the voltage detect logic will generate the interrupt flag at 
//		the specified voltage range
//	0 = Indicates that the voltage detect logic will not generate the interrupt flag 
//		at the specified voltage range and the HLVD interrupt should not be enabled
#define HLVDFLAG_ON			0b00100000
#define HLVDFLAG_OFF		0x00

//	bit 4 HLVDEN: High/Low-Voltage Detect Power Enable bit
//	1 = HLVD enabled
//	0 = HLVD disabled
#define HLVD_ON				0b00010000
#define HLVD_OFF			0x00

//	bit 3-0 HLVDL3:HLVDL0: Voltage Detection Limit bits(1)
//	1111 = External analog input is used (input comes from the HLVDIN pin)
//	1110 = Maximum setting
//	.
//	.
//	.
//	0000 = Minimum setting
//	Note 1: See Table 28-4 for sp
#define HLVD_EXT		0b00001111
#define HLVD_15			0b00001110
#define HLVD_14			0b00001110
#define HLVD_13			0b00001101
#define HLVD_12			0b00001100
#define HLVD_11			0b00001011
#define HLVD_10			0b00001010
#define HLVD_9			0b00001001
#define HLVD_8			0b00001000
#define HLVD_7			0b00000111
#define HLVD_6			0b00000110
#define HLVD_5			0b00000101
#define HLVD_4			0b00000100
#define HLVD_3			0b00000011
#define HLVD_2			0b00000010
#define HLVD_1			0b00000001
#define HLVD_0			0x00       


/*
				              _  _                     
				__      __ __| || |_  ___  ___   _ __  
				\ \ /\ / // _` || __|/ __|/ _ \ | '_ \ 
				 \ V  V /| (_| || |_| (__| (_) || | | |
				  \_/\_/  \__,_| \__|\___|\___/ |_| |_|
					WATCHDOG TIMER CONTROL REGISTER  						  */

//	bit 0 SWDTEN: Software Controlled Watchdog Timer Enable bit(1)
//	1 = Watchdog Timer is on
//	0 = Watchdog Timer is off
//	Note 1: This bit has no effect if the configuration bit, WDTEN, is enabled.
#define SWDT_ON			0b00000001
#define SWDT_OFF		0x0

