marzzelo/C18/SRC/rx433/p18f8722_defs.h
/*
					 _ __  ___  ___   _ __  
					| '__|/ __|/ _ \ | '_ \ 
					| |  | (__| (_) || | | |
					|_|   \___|\___/ |_| |_|			                        
					 RESET CONTROL REGISTER									  */

//			R/W-0 	R/W-1	 	U-0 	R/W-1 	R-1 	R-1 	R/W-0	R/W-0
//			IPEN 	SBOREN 		— 		RI 		TO 		PD 		POR 	BOR
//			bit 7 														bit 0
//			
//	bit 7 IPEN: Interrupt Priority Enable bit
//	1 = Enable priority levels on interrupts
//	0 = Disable priority levels on interrupts (PIC16CXXX Compatibility mode)	
#define IPEN_ON			0b10000000
#define IPEN_OFF		0x00

//	bit 6 SBOREN: BOR Software Enable bit(1)
//	If BOREN1:BOREN0 = 01:
//	1 = BOR is enabled
//	0 = BOR is disabled
//	If BOREN1:BOREN0 = 00, 10 or 11:
//	Bit is disabled and read as ‘0’.
#define BOR_ON			0b01000000
#define BOR_OFF			0x0
  	
//	Note 1: If SBOREN is enabled, its Reset state is ‘1’; otherwise, it is ‘0’.


/*
			 	 ____ ____  ____        ____ _____  _  _____ 
				/ ___/ ___||  _ \__  __/ ___|_   _|/ \|_   _|
				\___ \___ \| |_) \ \/ /\___ \ | | / _ \ | |  
				 ___) |__) |  __/ >  <  ___) || |/ ___ \| |  
				|____/____/|_|   /_/\_\|____/ |_/_/   \_\_|  
					MSSPx STATUS REGISTER (SPI™ MODE) */
	
//	R/W-0 	R/W-0 	R-0 	R-0 	R-0 	R-0 	R-0 	R-0
//	SMP 	CKE 	D/A 	P 		S 		R/W 	UA 		BF
//	bit 7 													bit 0
		
//	bit 7 SMP: Sample bit
//	SPI Master mode:
//	1 = Input data sampled at end of data output time
//	0 = Input data sampled at middle of data output time
//	SPI Slave mode:
//	SMP must be cleared when SPI is used in Slave mode.
#define SMP_END		0b10000000
#define SMP_MID		0x00

//	bit 6 CKE: SPI Clock Select bit
//	1 = Transmit occurs on transition from active to Idle clock state
//	0 = Transmit occurs on transition from Idle to active clock state
//	Note: Polarity of clock state is set by the CKP bit (SSPxCON1<4>).
#define TRM_ACT_IDLE	0b01000000
#define TRM_IDLE_ACT	0x00

/* 

				 ____ ____  ____        ____ ___  _   _ _ 
				/ ___/ ___||  _ \__  __/ ___/ _ \| \ | / |
				\___ \___ \| |_) \ \/ / |  | | | |  \| | |
				 ___) |__) |  __/ >  <| |__| |_| | |\  | |
				|____/____/|_|   /_/\_\\____\___/|_| \_|_|
				   MSSPx CONTROL REGISTER 1 (SPI™ MODE)  */

//			R/W-0 	R/W-0 	R/W-0 	R/W-0 	R/W-0 	R/W-0 	R/W-0 	R/W-0
//			WCOL 	SSPOV 	SSPEN 	CKP 	SSPM3 	SSPM2 	SSPM1 	SSPM0
//			bit 7 													bit 0
//	
//	bit 7 WCOL: Write Collision Detect bit
//	1 = The SSPxBUF register is written while it is still transmitting the previous word
//	(must be cleared in software)
//	0 = No collision
#define WCOL_RESET	0x00

//	bit 6 SSPOV: Receive Overflow Indicator bit
//	SPI Slave mode:
//	1 = A new byte is received while the SSPxBUF register is still holding the previous data. In case
//	of overflow, the data in SSPxSR is lost. Overflow can only occur in Slave mode. The user
//	must read the SSPxBUF, even if only transmitting data, to avoid setting overflow (must be
//	cleared in software).
//	0 = No overflow
//	Note: In Master mode, the overflow bit is not set since each new reception (and
//	transmission) is initiated by writing to the SSPxBUF register.
#define SSPOV_RESET	0x00

//	bit 5 SSPEN: Synchronous Serial Port Enable bit
//	1 = Enables serial port and configures SCKx, SDOx, SDIx and SSx as serial port pins
//	0 = Disables serial port and configures these pins as I/O port pins
//	Note: When enabled, these pins must be properly configured as input or output.
#define SSP_ENABLE 	0b00100000
#define SSP_DISABLE 0x00

//	bit 4 CKP: Clock Polarity Select bit
//	1 = Idle state for clock is a high level
//	0 = Idle state for clock is a low level
#define CKP_IDLEISHI	0b00010000
#define CKP_IDLEISLO	0x00

//	bit 3-0 SSPM3:SSPM0: Synchronous Serial Port Mode Select bits
//	0101 = SPI Slave mode, clock = SCKx pin, SSx pin control disabled, SSx can be used as I/O pin
//	0100 = SPI Slave mode, clock = SCKx pin, SSx pin control enabled
//	0011 = SPI Master mode, clock = TMR2 output/2
//	0010 = SPI Master mode, clock = FOSC/64
//	0001 = SPI Master mode, clock = FOSC/16
//	0000 = SPI Master mode, clock = FOSC/4
//	Note: Bit combinations not specifically listed here are either reserved or implemented in
//	I2C mode only.
#define SSPM_SLAVE			0b00000101
#define SSPM_SLAVE_SS 		0b00000100
#define SSPM_MASTER_TMR2	0b00000011
#define SSPM_MASTER_64		0b00000010
#define SSPM_MASTER_16		0b00000001
#define SSPM_MASTER_4		0x00
